---
kind: type
id: T:Autodesk.Revit.Exceptions.RevitServerException
source: html/cb9f496c-f65b-7d27-0fe4-e42f80261b38.htm
---
# Autodesk.Revit.Exceptions.RevitServerException

The exception that is base class for all exceptions originating from the Revit server.

## Syntax (C#)
```csharp
[SerializableAttribute]
public class RevitServerException : ApplicationException
```